# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

first_string = input ("Введите строку: ")
second_string = input ("Введите искомое значение: ")
print (first_string.count(second_string))
