# 3. Написать функцию, аргументы имена сотрудников,
# возвращает словарь, ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def dictionary_with_meaning(*string):
    names_dict = {}
    for i in sorted(string):
        letter = i[0]
        if letter not in names_dict:
            names_dict[letter] = [i]
        else:
            names_dict[letter] += [i]

    return names_dict

print(dictionary_with_meaning("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))